app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('Lipo Valdez', 'lipovaldez1304@gmail.com', '$2y$10$lZCoVql0mZi8MyEfzEM3cOTPHRGzEo2BDS45wmQHXTAUjItp1zNDm', 'user', '2025-09-11 03:42:59', '2025-09-11 03:42:59')
---
    public function register()
    {
        helper(['form']);
        if ($this->request->getMethod() === 'post') {
            $rules = [
                'name' => 'required|min_length[3]',
                'email' => 'required|valid_email|is_unique[users.email]',
                'password' => 'required|min_length[6]',
                'password_confirm' => 'matches[password]'
            ];

            if ($this->validate($rules)) {
                $userModel = new UserModel();
                $userModel->save([
                    'name' => $this->request->getPost('name'),
                    'email' => $this->request->getPost('email'),
                    'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
                ]);